# RemoveItem Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainer..::..RemoveItem Method
RebarContainer Class See Also
---
Removes Item from the Rebar Container.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void RemoveItem(
	RebarContainerItem pItem
)
```

Visual Basic
---
```text
Public Sub RemoveItem ( _
	pItem As RebarContainerItem _
)
```

Visual C++
---
```text
public:
void RemoveItem(
	RebarContainerItem^ pItem
)
```

# ### Parameters
pItem
    Type: Autodesk.Revit.DB.Structure..::..RebarContainerItem Item to be removed from this Rebar Container
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The item is not a member of this Rebar Container element. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace